---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.DirectShapeFailures
source: html/04a81184-539d-3f62-561b-6fdb5aa151aa.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DirectShapeFailures

Failure definitions related to DirectShapes.

## Syntax (C#)
```csharp
public static class DirectShapeFailures
```